#### FilterStringEndsWith Members

---

|  |
| --- |
| FilterStringEndsWith Class   Constructors   Methods   Properties   See Also |

The  FilterStringEndsWith  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | FilterStringEndsWith | Constructs an instance of FilterStringEndsWith. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | (Inherited from  FilterStringRuleEvaluator  .) |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | Evaluate | Derived classes override this method to implement the test that determines whether the two given string values satisfy the desired condition or not. (Inherited from  FilterStringRuleEvaluator  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from  FilterStringRuleEvaluator  .) |

# See Also

FilterStringEndsWith Class

Autodesk.Revit.DB Namespace